[
  {
    "id": 1,
    "text": "Why do programmers prefer dark mode? Because light attracts bugs.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 2,
    "text": "I told my computer I needed a break… it said 'No problem — I’ll go to sleep.'",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 3,
    "text": "Why did the scarecrow get promoted? He was outstanding in his field.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1001,
    "text": "I tried to teach my router a bedtime routine. Now it only disconnects after a story.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1002,
    "text": "Why did the keyboard break up with the mouse? It felt like it was being clicked with.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1003,
    "text": "I told my computer I’d clean up my files. It opened the recycle bin like, 'be my guest.'",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1004,
    "text": "My code was so polite today. It kept returning early.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1005,
    "text": "Why don’t servers ever get lonely? They have plenty of connections.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1006,
    "text": "I asked DNS for directions. It said, 'That depends—what do you *mean* by home?'",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1007,
    "text": "Why did the laptop bring a jacket? It heard the office was full of cold starts.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1008,
    "text": "I tried to make a belt out of USB cables. Total waist of bandwidth.",
    "rating": "G",
    "category": "pun",
    "active": true
  },
  {
    "id": 1009,
    "text": "My password is so strong it refuses to lift anything.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1010,
    "text": "Why did the spreadsheet look confident? It had all its cells together.",
    "rating": "G",
    "category": "office",
    "active": true
  },
  {
    "id": 1011,
    "text": "I set my alarm to 'update mode.' Now it wakes me up, restarts, and forgets why.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1012,
    "text": "Why did the printer get invited to every party? It really knows how to make an impression.",
    "rating": "G",
    "category": "office",
    "active": true
  },
  {
    "id": 1013,
    "text": "I bought a book on debugging. It was full of plot fixes.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1014,
    "text": "Why did the cable go to school? To improve its connection skills.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1015,
    "text": "My Wi-Fi and I are taking a break. It says I’m too attached.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1016,
    "text": "Why did the monitor join a band? It had great screen presence.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1017,
    "text": "I asked my code for a hint. It said, 'Try again.'",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1018,
    "text": "Why did the cloud bring an umbrella? Too many requests for showers.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1019,
    "text": "I tried to make a joke about RAM… but I couldn’t remember it.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1020,
    "text": "Why did the calendar feel stressed? It had too many dates.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1021,
    "text": "My computer loves winter. It runs better when the fans are in season.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1022,
    "text": "Why did the USB stick apply for a job? It wanted to be more than just storage.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1023,
    "text": "I told my laptop to stop multitasking. It opened 12 tabs to prove it could.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1024,
    "text": "Why don’t bugs ever get promoted? They keep showing up in the wrong places.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1025,
    "text": "I tried to write a joke about backups. Don’t worry—I saved it for later.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1026,
    "text": "Why did the helpdesk bring snacks? For the support tickets.",
    "rating": "G",
    "category": "office",
    "active": true
  },
  {
    "id": 1027,
    "text": "My mouse is very dramatic. It always makes a point.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1028,
    "text": "Why did the switch feel powerful? It controlled the room’s mood lighting.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1029,
    "text": "I tried to make a joke about encryption… but it’s classified.",
    "rating": "G",
    "category": "tech",
    "active": true
  },
  {
    "id": 1030,
    "text": "Why did the QR code get a standing ovation? It really brought people together.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1031,
    "text": "Why can't football players wear glasses on the field? Because it's a contact sport!",
    "rating": "G",
    "category": "sports",
    "active": true
  },
  {
    "id": 1032,
    "text": "What do you get when you mix alcohol with literature? Tequila Mockingbird!",
    "rating": "G",
    "category": "literature",
    "active": true
  },
  {
    "id": 1033,
    "text": "All the toilets in the NYPD headquarters have been stolen... The police apparently have nothing to go on!",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1034,
    "text": "When is a piece of wood like a King? When it is a ruler!",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1035,
    "text": "Why don't cows have money? Because the farmers milk them dry!",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1036,
    "text": "What did the drummer call his twin daughters? Anna One, Anna Two!",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1037,
    "text": "I wanted to learn how to drive a stick shift... But I couldn't find a manual.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1038,
    "text": "How do pigs communicate with each other? They use swine language.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1039,
    "text": "Did you hear about the circus fire? It was in tents!",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1040,
    "text": "How do you catch a squirrel? Climb a tree and act like a nut!",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1041,
    "text": "Did you hear about the guy who invented Lifesavers? They say he made a mint!",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1042,
    "text": "I told my wife she should embrace her mistakes. She gave me a hug.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1043,
    "text": "Why don't eggs tell jokes? They might crack up!",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1044,
    "text": "I went to buy some camouflage pants, but I couldn't find any.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1045,
    "text": "What did the grape say when it got stepped on? Nothing, it just let out a little wine.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1046,
    "text": "I used to have a job at a calendar factory, but I got fired because I took a couple of days off.",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1047,
    "text": "What do you call a snowman with a six-pack? An abdominal snowman!",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1048,
    "text": "Why don't skeletons fight each other? They don't have the guts!",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1049,
    "text": "Did you hear about the restaurant on the moon? Great food, no atmosphere!",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1050,
    "text": "Why did the math book look sad? Because it had too many problems!",
    "rating": "G",
    "category": "dad",
    "active": true
  },
  {
    "id": 1051,
    "text": "Black shiny mollies and bright colored guppies, Shy little angels as gentle as puppies, Swimming and diving with scarcely a swish, They were just some of my tropical fish. Then I got mantas that sting in the water, Deadly piranhas that itch for a slaughter, Savage male betas that bite with a squish, Now I have many less tropical fish. If you think that Fish are peaceful That's an empty wish. Just dump them together And leave them alone, And soon you will have -- no fish. -- To My Favorite Things",
    "rating": "G",
    "category": "fortune",
    "active": true
  },
  {
    "id": 1052,
    "text": "My doctor told me to stop having intimate dinners for four. Unless there are three other people. -- Orson Welles",
    "rating": "G",
    "category": "fortune",
    "active": true
  },
  {
    "id": 1053,
    "text": "A guy returns from a long trip to Europe, having left his beloved dog in his brother's care. The minute he's cleared customs, he calls up his brother and inquires after his pet. \"Your dog's dead,\" replies his brother bluntly. The guy is devastated. \"You know how much that dog meant to me,\" he moaned into the phone. \"Couldn't you at least have thought of a nicer way of breaking the news? Couldn't you have said, `Well, you know, the dog got outside one day, and was crossing the street, and a car was speeding around a corner...' or something...? Why are you always so thoughtless?\" \"Look, I'm sorry,\" said his brother, \"I guess I just didn't think.\" \"Okay, okay, let's just put it behind us. How are you anyway? How's Mom?\" His brother is silent a moment. \"Uh,\" he stammers, \"uh... Mom got outside one day...\"",
    "rating": "PG",
    "category": "fortune",
    "active": true
  },
  {
    "id": 1054,
    "text": "One way to make your old car run better is to look up the price of a new model.",
    "rating": "PG",
    "category": "fortune",
    "active": true
  },
  {
    "id": 1055,
    "text": "What do a blonde and your computer have in common? You don't know how much either of them mean to you until they go down on you.",
    "rating": "PG-13",
    "category": "fortune",
    "active": true
  },
  {
    "id": 1056,
    "text": "What's the advantage to being married to a blonde? You can park in the handicapped zone.",
    "rating": "PG-13",
    "category": "fortune",
    "active": true
  },
  {
    "id": 1057,
    "text": "Why did the blonde get so excited after she finished her jigsaw puzzle in only 6 months? Because on the box it said \"From 2-4 years\".",
    "rating": "PG-13",
    "category": "fortune",
    "active": true
  },
  {
    "id": 1058,
    "text": "The scene: in a vast, painted desert, a cowboy faces his horse. Cowboy: \"Well, you've been a pretty good hoss, I guess. Hardworkin'. Not the fastest critter I ever come acrost, but...\" Horse: \"No, stupid, not feed*back*. I said I wanted a feed*bag*.",
    "rating": "G",
    "category": "fortune",
    "active": true
  }
]
